app/controllers/documents_controller.rb

SELECT "documents".* FROM "documents"
---
  def index
 		@documents = Document.all

INSERT INTO "documents" ("attachment", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["attachment", "examples.desktop"], ["created_at", "2014-10-19 05:35:27.518722"], ["name", "wz"], ["updated_at", "2014-10-19 05:35:27.518722"]]
---
  def create
		@document = Document.new(document_params)

		if @document.save

SELECT  "documents".* FROM "documents"  WHERE "documents"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "documents" WHERE "documents"."id" = ?  [["id", 1]]
---
  def destroy
		@document = Document.find(params[:id])
		@document.destroy